Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །གཟུགས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of physical forms, bodhisattvas do not apprehend the limit of the past.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the limit of the past.

source: །གཟུགས་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of physical forms, bodhisattvas do not apprehend the limit of the past.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the limit of the past.

source: །གཟུགས་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in physical forms, bodhisattvas do not apprehend the limit of the past.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the limit of the past. “

source: །གཟུགས་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the nonexistence of physical forms, bodhisattvas do not apprehend the limit of the future.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the nonexistence of feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the limit of the future.

source: །གཟུགས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of physical forms, bodhisattvas do not apprehend the limit of the future.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the limit of the future.

source: །གཟུགས་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of physical forms, bodhisattvas do not apprehend the limit of the future.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the limit of the future.

source: །གཟུགས་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in physical forms, bodhisattvas do not apprehend the limit of the future.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the limit of the future. “

source: །གཟུགས་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the nonexistence of physical forms, bodhisattvas do not apprehend the intervening present.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the nonexistence of feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the intervening present.

source: །གཟུགས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the emptiness of physical forms, bodhisattvas do not apprehend the intervening present.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the emptiness of feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the intervening present.

source: །གཟུགས་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the voidness of physical forms, bodhisattvas do not apprehend the intervening present.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the voidness of feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the intervening present.

source: །གཟུགས་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in physical forms, bodhisattvas do not apprehend the intervening present.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་དང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་པ་དང་། གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་།
en: Owing to the lack of inherent existence in feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the intervening present. “

source: རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་དང་། གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དབེན་པ་དང་། གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ངོ་བོ་ཉིད་མེད་པ་ལ་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་ཏེ།
en: If you ask why, Venerable Śāradvatīputra, the limit of the past is not apprehended, the limit of the future is not apprehended, and the intervening present is not apprehended in physical forms, feelings, perceptions, formative predispositions, and consciousness that are nonexistent; in physical forms, feelings, perceptions, formative predispositions, and consciousness that are emptiness; in physical forms, feelings, perceptions, formative predispositions, and consciousness that are void; or in physical forms, feelings, perceptions, formative predispositions, and consciousness that are without inherent existence.

source: གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་པ་དང་། སྟོང་པ་ཉིད་དང་དབེན་པ་དང་ངོ་བོ་ཉིད་མེད་པ་ཡང་གཞན་མ་ཡིན། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་མ་ཡིན། སྔོན་གྱི་མཐའ་ཡང་གཞན་མ་ཡིན། ཕྱི་མའི་མཐའ་ཡང་གཞན་མ་ཡིན། དབུས་ཀྱང་གཞན་མ་ཡིན་ནོ།
en: That is to say, the nonexistence, emptiness, voidness, and lack of inherent existence in physical forms, feelings, perceptions, formative predispositions, and consciousness are not one distinct thing and bodhisattvas another, nor are the limit of the past, the limit of the future, and the intervening present distinct things.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་གཟུགས་དང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་པ་དང་། སྟོང་པ་ཉིད་དང་དབེན་པ་དང་ངོ་བོ་ཉིད་མེད་པ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། སྔོན་གྱི་མཐའ་གང་ཡིན་པ་དང་།
en: Venerable Śāradvatīputra, so it is that physical forms, feelings, perceptions, formative predispositions, and consciousness that are nonexistent, empty, void, and lacking inherent existence, and the bodhisattvas, the limit of the past, the limit of the future, and the intervening present, are all indeed not two things and are not to be divided into two. “

source: ཕྱི་མའི་མཐའ་གང་ཡིན་པ་དང་། དབུས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, owing to the nonexistence of the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the limit of the past.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the limit of the past.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the limit of the past.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the limit of the past. “

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the nonexistence of the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the limit of the future.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the limit of the future.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the limit of the future.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the limit of the future. “

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the nonexistence of the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the intervening present.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the emptiness of the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the intervening present.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the voidness of the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the intervening present.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Owing to the lack of inherent existence in the sense fields, the sensory elements, and the links of dependent origination, bodhisattvas do not apprehend the intervening present.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མེད་པ་དང་། སྟོང་པ་ཉིད་དབེན་པ་དང་ངོ་བོ་ཉིད་མེད་པ་ལ་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་ཏེ།
en: If you ask why, Venerable Śāradvatīputra, the limit of the past is not apprehended, the limit of the future is not apprehended, and the intervening present is not apprehended in the sense fields, the sensory elements, and the links of dependent origination that are nonexistent, empty, void, and without inherent existence.

source: སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མེད་པ་དང་། སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ཡང་གཞན་མ་ཡིན། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་མ་ཡིན། སྔོན་གྱི་མཐའ་ཡང་གཞན་མ་ཡིན། ཕྱི་མའི་མཐའ་ཡང་གཞན་མ་ཡིན། དབུས་ཀྱང་གཞན་མ་ཡིན་ནོ།
en: That is to say, the nonexistence, emptiness, voidness, and lack of inherent existence in the sense fields, the sensory elements, and the links of dependent origination are not one distinct thing and bodhisattvas another, nor are the limit of the past, the limit of the future, and the intervening present distinct things.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མེད་པ་དང་། སྟོང་པ་ཉིད་དང་དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་གང་ཡིན་པ་དང་།
en: Venerable Śāradvatīputra, so it is that the sense fields, the sensory elements, and the links of dependent origination that are nonexistent, empty, void, and lacking inherent existence, and the bodhisattvas, the limit of the past, the limit of the future, and the intervening present, are all indeed not two things and are not to be divided into two. “

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། སྔོན་གྱི་མཐའ་གང་ཡིན་པ་དང་། ཕྱི་མའི་མཐའ་གང་ཡིན་པ་དང་། དབུས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པའི་ཕྱིར།
en: Venerable Śāradvatīputra, owing to the nonexistence of the perfection of generosity, bodhisattvas do not apprehend the limit of the past.

source: བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Owing to the nonexistence of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, bodhisattvas do not apprehend the limit of the past.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of the perfection of generosity, bodhisattvas do not apprehend the limit of the past.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར།
en: Owing to the emptiness of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, bodhisattvas do not apprehend the limit of the past.

source: བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of the perfection of generosity, bodhisattvas do not apprehend the limit of the past.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དབེན་པའི་ཕྱིར།
en: Owing to the voidness of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, bodhisattvas do not apprehend the limit of the past.

source: བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in the perfection of generosity, bodhisattvas do not apprehend the limit of the past.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར།
en: Owing to the lack of inherent existence in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, bodhisattvas do not apprehend the limit of the past. “

source: བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the nonexistence of the perfection of generosity, bodhisattvas do not apprehend the limit of the future.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པའི་ཕྱིར།
en: Owing to the nonexistence of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, bodhisattvas do not apprehend the limit of the future.

source: བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of the perfection of generosity, bodhisattvas do not apprehend the limit of the future.

source: བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Owing to the voidness of the perfection of generosity, bodhisattvas do not apprehend the limit of the future.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, bodhisattvas do not apprehend the limit of the future.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Owing to the lack of inherent existence in the perfection of generosity, bodhisattvas do not apprehend the limit of the future.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, bodhisattvas do not apprehend the limit of the future. “

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the nonexistence of the perfection of generosity, bodhisattvas do not apprehend the intervening present.

source: བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the emptiness of the perfection of generosity, bodhisattvas do not apprehend the intervening present.

source: བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the voidness of the perfection of generosity, bodhisattvas do not apprehend the intervening present.

source: བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in the perfection of generosity, bodhisattvas do not apprehend the intervening present.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, bodhisattvas do not apprehend the intervening present.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: If you ask why, Venerable Śāradvatīputra, the limit of the past is not apprehended, the limit of the future is not apprehended, and the intervening present is not apprehended in the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom that are nonexistent, empty, void, and without inherent existence.

source: དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ལ་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་ཏེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: That is to say, the nonexistence, emptiness, voidness, and lack of inherent existence in the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are not one distinct thing and bodhisattvas another, nor are the limit of the past, the limit of the future, and the intervening present distinct things.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པ་དང་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ཡང་གཞན་མ་ཡིན།
en: Venerable Śāradvatīputra, so it is that the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom that are nonexistent, empty, void, and lacking inherent existence, and the bodhisattvas, the limit of the past, the limit of the future, and the intervening present, are all indeed not two things and are not to be divided into two. “

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་མ་ཡིན། སྔོན་གྱི་མཐའ་ཡང་གཞན་མ་ཡིན། ཕྱི་མའི་མཐའ་ཡང་གཞན་མ་ཡིན། དབུས་ཀྱང་གཞན་མ་ཡིན་ནོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པ་དང་།
en: Venerable Śāradvatīputra, owing to the nonexistence of the emptiness of internal phenomena, bodhisattvas do not apprehend the limit of the past.

source: སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། སྔོན་གྱི་མཐའ་གང་ཡིན་པ་དང་།
en: Owing to the nonexistence of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, bodhisattvas do not apprehend the limit of the past.

source: ཕྱི་མའི་མཐའ་གང་ཡིན་པ་དང་། དབུས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ནང་སྟོང་པ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of the emptiness of internal phenomena, bodhisattvas do not apprehend the limit of the past.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །ནང་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, bodhisattvas do not apprehend the limit of the past.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །ནང་སྟོང་པ་ཉིད་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of the emptiness of internal phenomena, bodhisattvas do not apprehend the limit of the past.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, bodhisattvas do not apprehend the limit of the past.

source: །ནང་སྟོང་པ་ཉིད་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in the emptiness of internal phenomena, bodhisattvas do not apprehend the limit of the past.
